{
  "hexagrams": [
    {
      "id": 0,
      "name": "",
      "description": "",
      "line_one": "",
      "line_two": "",
      "line_three": "",
      "line_four": "",
      "line_five": "",
      "line_six": ""
    },
    {
      "id": 1,
      "name": "Ch'ien / Creative Activity",
      "description": "Heaven above and Heaven below: Heaven in constant motion. With the strength of the dragon, the Superior Person steels himself for ceaseless activity.  Productive Activity. Potent Influence. Sublime Success if you keep to your course.  SITUATION ANALYSIS: The time for action has come. You now have the focus and the stamina necessary for accomplishing great tasks. The path before you is being cleared and reward lies ahead. ",
      "line_one": "The dragon remains beneath the surface. Do not act.",
      "line_two": "The dragon climbs to the surface. Seek advice from an authority you respect.",
      "line_three": "The Superior Person builds by day and remains vigilant through the night. Danger, but he will persevere.",
      "line_four": "The flying dragon hovers over the chasm from which he was born.",
      "line_five": "The dragon rises high for all to see. He has become the mentor he always longed to find.",
      "line_six": "Even a dragon may fly too high."
    },
    {
      "id": 2,
      "name": "K'un / Receptive Force",
      "description": "Earth above and Earth below: The Earth contains and sustains. In this situation, the Superior Person should not take the initiative; he should follow the initiative of another. He should seek receptive allies in the southwest; he should break ties with immovable allies in the northeast.  Responsive devotion. Receptive influence. Sublime Success if you keep to your course.  SITUATION ANALYSIS: This is a time for dealing with reality as it is, not as you would have it be. If you realize that in this situation you are the receptor, not the transmitter of the stimulus, you will find yourself reaching goals that seemed unattainable under your own steam. If you persist in futile efforts to be the Shaper rather than the Shaped, you will completely miss this unique opportunity. ",
      "line_one": "When frost crunches underfoot can winter ice be far behind?",
      "line_two": "Straight, square, and true. By being instead of doing, nothing is left undone.",
      "line_three": "Hide your brilliance. Feeling no threat, they won't resist the completion of your goal. All you lose is credit for the accomplishment.",
      "line_four": "Be a tied-up sack, letting your inner contents remain unseen. There will be no praise, but also no blame.",
      "line_five": "A yellow robe. Supreme good fortune.",
      "line_six": "The battling dragons are too evenly matched. Each spills black and yellow blood to the soil below."
    },
    {
      "id": 3,
      "name": "Chun / Difficulty at the Beginning",
      "description": "Thunder from the Deep: The Superior Person carefully weaves order out of confusion.  Supreme Success if you keep to your course. Carefully consider the first move. Seek help.  SITUATION ANALYSIS: New ventures always pack along their inherent chaos. Though this is an annoyance at best, and can even imperil or downright doom an endeavor, it is also the friction needed to polish your project to jewel brilliance. Learn from these early obstacles. ",
      "line_one": "You have run up against an obstacle at the very head of the trail. Keep to your course. Seek mutual aid.",
      "line_two": "Her horses rear in fright; but the highwayman means no harm. He seeks only the hand of the maiden. She must refuse him, for she fears a very long journey lies ahead before she can marry.",
      "line_three": "A hunter who pursues his prey without a guide will lose his way in the deeps of the forest. The Superior Person knows his limitations and gives up the chase. To advance brings regret.",
      "line_four": "Her horses break away. Turning back, she must learn to trust, and accept the escort of her spurned highwayman. What seemed at first misfortune will lead to marriage.",
      "line_five": "He could rescue them, if only they would trust. For now, he must provide protection and small comfort from the shadows.",
      "line_six": "The horses break free. If the need for aid goes unrecognized, tears and blood will flow."
    },
    {
      "id": 4,
      "name": "Mêng / Inexperience",
      "description": "A fresh Spring at the foot of the Mountain: The Superior Person refines his character by being thorough in every activity. The Sage does not recruit students; the students seek him. He asks nothing but a sincere desire to learn. If the student doubts or challenges his authority, the Sage regretfully cuts his losses.  SITUATION ANALYSIS: This is a time of interchange between a mentor and pupil. Whether you are the teacher or the student, it is a time of companionship along a mutual path. This hexagram also emphasizes the eternal, cyclical nature of the mentor/student relationship -- a mentor is merely a more seasoned pupil, further along on the journey. A pupil holds within himself the seed of a future Master. ",
      "line_one": "A little discipline will make the fool sit up and take notice. Afterwards, the matter should be dropped, or some will question which is the master and which the fool.",
      "line_two": "The man is gentle with the misguided and understands the hearts of women.  Such a one can be trusted with the kingdom.",
      "line_three": "No one respects a lovestruck woman who throws herself at the object of her desire. Do not idolize.",
      "line_four": "You are so terrified of being wrong, you leave no room for learning what is right.",
      "line_five": "Like a wide-eyed child, you wholly and naively trust the goodness of others. Such honor brings out their best.",
      "line_six": " The best way to prove a fool wrong is to let him have his way. To severely restrict his folly will invite him to always believe that his way would have been right."
    },
    {
      "id": 5,
      "name": "Hsü / Calculated Waiting",
      "description": " Deep Waters in the Heavens: Thunderclouds approaching from the West, but no rain yet. The Superior Person nourishes himself and remains of good cheer to condition himself for the moment of truth.  Great Success if you sincerely keep to your course. You may cross to the far shore.  SITUATION ANALYSIS: You must now endure this Dangling -- either a carrot before your nose, or a sword above your head. This strange mix of apprehension and anticipation is a Purgatory. There is nothing more you can do to affect the outcome. You must now submit to the Fates. ",
      "line_one": "No trouble in sight, but vague anxieties about what lies beyond the horizon. Whether real or not, the threat has already won your peace of mind.",
      "line_two": "Taking your post in the sand, ceaselessly watching the far shore for enemy movements, you must endure the taunts and contempt of your comrades. Good fortune in the end.",
      "line_three": "Anxiety prods you to premature action. Wading into the river, you become mired in the bed of mud. Not only does the enemy realize you detect them, but they see your vulnerability as an opportunity to strike.",
      "line_four": "The enemy is upon you. You wait in blood, preparing yourself for their blows; but your own ability can see you through, if you stand your ground and maintain balance.",
      "line_five": "You smile and join in the banquet, relaxing and gaining perspective, yet vigilant and prepared for the next onslaught. Such genuine grace under pressure ensures victory and good fortune.",
      "line_six": "The showdown comes, with the opponents too evenly matched. Just as all hopes of survival are dashed, three strangers appear. They will tip the scales in favor of the contender who recognizes them for what they are."
    },
    {
      "id": 6,
      "name": "Sung / Conflict",
      "description": "The high Heavens over a yawning Deep chasm: An expansive void where nothing can dwell. Even though he sincerely knows he is right, the Superior Person anticipates opposition and carefully prepares for any incident.  Good fortune if your conflict results in compromise. Misfortune if your conflict escalates to confrontation. Seek advice. Postpone your crossing to the far shore.  SITUATION ANALYSIS: Conflict is a necessary part of life. Tension upon the strings of a violin can make majestic music. The critical mass of two hydrogen atoms trying to occupy the same space fuel the sun that nourishes our solar system. Most conflicts you face in life are the result of your Path converging with another's. Your Path is not his, and one Path is not necessarily more right than the other. Can you work together to remove the blockage? ",
      "line_one": "No quarrel will blossom, unless you let your pride fertilize this budding conflict. Let the one who insults you expose himself for what he is. Don't fight this battle until you've already won it.",
      "line_two": "Knowing his comrades would be annihilated against their much stronger foe, he orders a full retreat, retires into seclusion, and is condemned by the very neighbors he saved from ruin.",
      "line_three": "He stands on his integrity, no matter what ill winds may blast him. Stand or fall, in the end he will remain exactly who he is.",
      "line_four": "Realizing the very root of conflict lies within his own heart, he lays down his arms and resolves to accept the things he cannot change.",
      "line_five": "Bring the conflict before a just authority. If you are truly in the right, justice will bring good fortune.",
      "line_six": "You can certainly win this conflict. Such a victory, though, will bring a lifetime of defending your prize against thieves and challengers."
    },
    {
      "id": 7,
      "name": "Shih / Recruiting Allies",
      "description": "Deep Water beneath the Earth's surface: Untapped resources are available. The Superior Person nourishes and instructs the people, building a loyal, disciplined following. Good fortune. No mistakes if you follow a course led by experience.  SITUATION ANALYSIS: You must gain support from others. Find a way to make others want to see your objectives met as badly as you want it. How can they profit from the attainment of this goal? Can you command confidence that you are just the person that can bring this plan to fruition? ",
      "line_one": "Knowing neither purpose nor direction, the soldiers march blindly onward.",
      "line_two": "The general marches with his soldiers, sharing their fate, good or bad, facing the consequences of his own decisions. For this he is loved and trusted by all.",
      "line_three": "A wagonload of corpses this way comes.",
      "line_four": "It is never a mistake to retreat to a stronger position.",
      "line_five": "The seasoned veteran is elevated to command, and none too soon. For the game is in the field, and it would be wise to catch it.",
      "line_six": "The victor divides the spoils among the loyal, leaving the jackals with neither reward nor obligation."
    },
    {
      "id": 8,
      "name": "Pi / Bonding",
      "description": "Deep Waters on the face of the Earth: Surface waters flow together. The Superior Person recognizes the situation calls for joining together. Thus he cultivates friendly relations with all.  Good fortune is possible. Cast the coins again to discover if you have the qualities needed to lead such a group. Then there will be no error. Those uncertain will gradually join. Those who join too late will meet with misfortune.  SITUATION ANALYSIS: This is a time of connection with another or others -- not just an alliance, but a melding of parts into a new whole. Such a connection may be too close, too intense for some. Consult the oracle again to see if you have the qualities needed to strengthen and withstand such an intense synthesis. ",
      "line_one": "Confidently and sincerely seeking union. His devotion to you and to truth makes this alliance correct.  Unexpected good fortune.",
      "line_two": "Devotion comes from deep inside you. Good fortune if you keep to your course.",
      "line_three": "You are seeking union with unworthy people.",
      "line_four": "You express your devotion humbly and openly. Good fortune if you keep to this course.",
      "line_five": "The hunter surrounds the game on only three sides, allowing an avenue of escape. In seeking allegiance with others, leave room for them to say 'no'; this way, those choosing to join you will be sincere.",
      "line_six": "Without a head, the union cannot hold together. Misfortune."
    },
    {
      "id": 9,
      "name": "Hsiao Ch'u / Gentle Restraint",
      "description": "Winds of change high in the Heavens: Air currents carry the weather. Dense clouds blow in from the West, but still no rain. The Superior Person fine tunes the image he presents to the world.  Small successes.  SITUATION ANALYSIS: No matter what you do, the fruit of your labors never seems to ripen. Your reward remains just out of reach. Men have gone mad from such anticipation. Don't lose your balance lunging for the brass ring. While the Fates continue to restrain you, go them one better and display a self-generated restraint and grace. Look for the humor in the situation. ",
      "line_one": "He turns back to his proper course. No harm done. In fact, good fortune comes of this return.",
      "line_two": "He lets himself be drawn back. Good fortune.",
      "line_three": "The spokes burst out of a wagon wheel, stopping the couple's journey. The man and wife waste time and energy blaming each other, causing major damage to their love instead of fixing the minor damage to the wagon.",
      "line_four": "By gaining confidence, the man keeps control of the conflict, avoiding the blood that could be spilled by fear. No mistakes.",
      "line_five": "His sincerity is the cord that binds the hearts of others to his. He holds wealth who holds the hearts of others. ",
      "line_six": "The needed rain finally pours down, bringing a well-earned time of rest. It is Nature's time to enrich the crops, so leave it to her. To work the fields in the rain and mud would only undo all good effort. Do not seek more; the gibbous moon seeks to be full, but once full can do nothing but wane."
    },
    {
      "id": 10,
      "name": "Lü / Worrying the Tiger",
      "description": "Heaven shines down on the Marsh which reflects it back imperfectly: Though the Superior Man carefully discriminates between high and low, and acts in accord with the flow of the Tao, there are still situations where a risk must be taken.  You tread upon the tail of the tiger. Not perceiving you as a threat, the startled tiger does not bite. Success.  SITUATION ANALYSIS: You have reached a perilous point in your journey. This is a real gamble -- not a maneuver, not a calculated risk. The outcome is uncertain. If it goes as you hope, you will gain -- but if it turns against you it will cause serious injury, at least to your plans. The best tack is extreme caution and a healthy respect for the danger involved.  Winds of change high in the Heavens: Air currents carry the weather. Dense clouds blow in from the West, but still no rain. The Superior Person fine tunes the image he presents to the world.  Small successes.  SITUATION ANALYSIS: No matter what you do, the fruit of your labors never seems to ripen. Your reward remains just out of reach. Men have gone mad from such anticipation. Don't lose your balance lunging for the brass ring. While the Fates continue to restrain you, go them one better and display a self-generated restraint and grace. Look for the humor in the situation. ",
      "line_one": "He treads the simple path of least resistance, making swift and blameless progress.",
      "line_two": "A man of modest independence treads a smooth and level path. Good fortune if you stay on course.",
      "line_three": "A one-eyed man may still see, a lame man may still walk, but it takes every resource to circumvent the tiger. When this tiger is stepped on he bites. Only a warrior supremely loyal to his cause would enter a battle he knows he hasn't the resources to survive.",
      "line_four": "He shows humble hesitation and breathless caution, yet still resolutely takes a necessary step on the tail of the tiger. His modest manner saves him from the bite.",
      "line_five": "Though fully aware of the danger that lies on the narrow path ahead, the man is fully commited to move forward. The future is uncertain.",
      "line_six": "At your journey's end, look back and examine the path you chose. If you find no causes for shame, only good works that make you shine, you may take this as an omen of the certainty of great reward."
    },
    {
      "id": 11,
      "name": "Ch'ien / Creative Activity",
      "description": "Heaven above and Heaven below: Heaven in constant motion. With the strength of the dragon, the Superior Person steels himself for ceaseless activity.  Productive Activity. Potent Influence. Sublime Success if you keep to your course.  SITUATION ANALYSIS: The time for action has come. You now have the focus and the stamina necessary for accomplishing great tasks. The path before you is being cleared and reward lies ahead. ",
      "line_one": "The dragon remains beneath the surface. Do not act.",
      "line_two": "The dragon climbs to the surface. Seek advice from an authority you respect.",
      "line_three": "The Superior Person builds by day and remains vigilant through the night. Danger, but he will persevere.",
      "line_four": "The flying dragon hovers over the chasm from which he was born.",
      "line_five": "The dragon rises high for all to see. He has become the mentor he always longed to find.",
      "line_six": "Even a dragon may fly too high."
    },
    {
      "id": 12,
      "name": "K'un / Receptive Force",
      "description": "Earth above and Earth below: The Earth contains and sustains. In this situation, the Superior Person should not take the initiative; he should follow the initiative of another. He should seek receptive allies in the southwest; he should break ties with immovable allies in the northeast.  Responsive devotion. Receptive influence. Sublime Success if you keep to your course.  SITUATION ANALYSIS: This is a time for dealing with reality as it is, not as you would have it be. If you realize that in this situation you are the receptor, not the transmitter of the stimulus, you will find yourself reaching goals that seemed unattainable under your own steam. If you persist in futile efforts to be the Shaper rather than the Shaped, you will completely miss this unique opportunity. ",
      "line_one": "When frost crunches underfoot can winter ice be far behind?",
      "line_two": "Straight, square, and true. By being instead of doing, nothing is left undone.",
      "line_three": "Hide your brilliance. Feeling no threat, they won't resist the completion of your goal. All you lose is credit for the accomplishment.",
      "line_four": "Be a tied-up sack, letting your inner contents remain unseen. There will be no praise, but also no blame.",
      "line_five": "A yellow robe. Supreme good fortune.",
      "line_six": "The battling dragons are too evenly matched. Each spills black and yellow blood to the soil below."
    },
    {
      "id": 13,
      "name": "Chun / Difficulty at the Beginning",
      "description": "Thunder from the Deep: The Superior Person carefully weaves order out of confusion.  Supreme Success if you keep to your course. Carefully consider the first move. Seek help.  SITUATION ANALYSIS: New ventures always pack along their inherent chaos. Though this is an annoyance at best, and can even imperil or downright doom an endeavor, it is also the friction needed to polish your project to jewel brilliance. Learn from these early obstacles. ",
      "line_one": "You have run up against an obstacle at the very head of the trail. Keep to your course. Seek mutual aid.",
      "line_two": "Her horses rear in fright; but the highwayman means no harm. He seeks only the hand of the maiden. She must refuse him, for she fears a very long journey lies ahead before she can marry.",
      "line_three": "A hunter who pursues his prey without a guide will lose his way in the deeps of the forest. The Superior Person knows his limitations and gives up the chase. To advance brings regret.",
      "line_four": "Her horses break away. Turning back, she must learn to trust, and accept the escort of her spurned highwayman. What seemed at first misfortune will lead to marriage.",
      "line_five": "He could rescue them, if only they would trust. For now, he must provide protection and small comfort from the shadows.",
      "line_six": "The horses break free. If the need for aid goes unrecognized, tears and blood will flow."
    },
    {
      "id": 14,
      "name": "Mêng / Inexperience",
      "description": "A fresh Spring at the foot of the Mountain: The Superior Person refines his character by being thorough in every activity. The Sage does not recruit students; the students seek him. He asks nothing but a sincere desire to learn. If the student doubts or challenges his authority, the Sage regretfully cuts his losses.  SITUATION ANALYSIS: This is a time of interchange between a mentor and pupil. Whether you are the teacher or the student, it is a time of companionship along a mutual path. This hexagram also emphasizes the eternal, cyclical nature of the mentor/student relationship -- a mentor is merely a more seasoned pupil, further along on the journey. A pupil holds within himself the seed of a future Master. ",
      "line_one": "A little discipline will make the fool sit up and take notice. Afterwards, the matter should be dropped, or some will question which is the master and which the fool.",
      "line_two": "The man is gentle with the misguided and understands the hearts of women.  Such a one can be trusted with the kingdom.",
      "line_three": "No one respects a lovestruck woman who throws herself at the object of her desire. Do not idolize.",
      "line_four": "You are so terrified of being wrong, you leave no room for learning what is right.",
      "line_five": "Like a wide-eyed child, you wholly and naively trust the goodness of others. Such honor brings out their best.",
      "line_six": " The best way to prove a fool wrong is to let him have his way. To severely restrict his folly will invite him to always believe that his way would have been right."
    },
    {
      "id": 15,
      "name": "Hsü / Calculated Waiting",
      "description": " Deep Waters in the Heavens: Thunderclouds approaching from the West, but no rain yet. The Superior Person nourishes himself and remains of good cheer to condition himself for the moment of truth.  Great Success if you sincerely keep to your course. You may cross to the far shore.  SITUATION ANALYSIS: You must now endure this Dangling -- either a carrot before your nose, or a sword above your head. This strange mix of apprehension and anticipation is a Purgatory. There is nothing more you can do to affect the outcome. You must now submit to the Fates. ",
      "line_one": "No trouble in sight, but vague anxieties about what lies beyond the horizon. Whether real or not, the threat has already won your peace of mind.",
      "line_two": "Taking your post in the sand, ceaselessly watching the far shore for enemy movements, you must endure the taunts and contempt of your comrades. Good fortune in the end.",
      "line_three": "Anxiety prods you to premature action. Wading into the river, you become mired in the bed of mud. Not only does the enemy realize you detect them, but they see your vulnerability as an opportunity to strike.",
      "line_four": "The enemy is upon you. You wait in blood, preparing yourself for their blows; but your own ability can see you through, if you stand your ground and maintain balance.",
      "line_five": "You smile and join in the banquet, relaxing and gaining perspective, yet vigilant and prepared for the next onslaught. Such genuine grace under pressure ensures victory and good fortune.",
      "line_six": "The showdown comes, with the opponents too evenly matched. Just as all hopes of survival are dashed, three strangers appear. They will tip the scales in favor of the contender who recognizes them for what they are."
    },
    {
      "id": 16,
      "name": "Sung / Conflict",
      "description": "The high Heavens over a yawning Deep chasm: An expansive void where nothing can dwell. Even though he sincerely knows he is right, the Superior Person anticipates opposition and carefully prepares for any incident.  Good fortune if your conflict results in compromise. Misfortune if your conflict escalates to confrontation. Seek advice. Postpone your crossing to the far shore.  SITUATION ANALYSIS: Conflict is a necessary part of life. Tension upon the strings of a violin can make majestic music. The critical mass of two hydrogen atoms trying to occupy the same space fuel the sun that nourishes our solar system. Most conflicts you face in life are the result of your Path converging with another's. Your Path is not his, and one Path is not necessarily more right than the other. Can you work together to remove the blockage? ",
      "line_one": "No quarrel will blossom, unless you let your pride fertilize this budding conflict. Let the one who insults you expose himself for what he is. Don't fight this battle until you've already won it.",
      "line_two": "Knowing his comrades would be annihilated against their much stronger foe, he orders a full retreat, retires into seclusion, and is condemned by the very neighbors he saved from ruin.",
      "line_three": "He stands on his integrity, no matter what ill winds may blast him. Stand or fall, in the end he will remain exactly who he is.",
      "line_four": "Realizing the very root of conflict lies within his own heart, he lays down his arms and resolves to accept the things he cannot change.",
      "line_five": "Bring the conflict before a just authority. If you are truly in the right, justice will bring good fortune.",
      "line_six": "You can certainly win this conflict. Such a victory, though, will bring a lifetime of defending your prize against thieves and challengers."
    },
    {
      "id": 17,
      "name": "Shih / Recruiting Allies",
      "description": "Deep Water beneath the Earth's surface: Untapped resources are available. The Superior Person nourishes and instructs the people, building a loyal, disciplined following. Good fortune. No mistakes if you follow a course led by experience.  SITUATION ANALYSIS: You must gain support from others. Find a way to make others want to see your objectives met as badly as you want it. How can they profit from the attainment of this goal? Can you command confidence that you are just the person that can bring this plan to fruition? ",
      "line_one": "Knowing neither purpose nor direction, the soldiers march blindly onward.",
      "line_two": "The general marches with his soldiers, sharing their fate, good or bad, facing the consequences of his own decisions. For this he is loved and trusted by all.",
      "line_three": "A wagonload of corpses this way comes.",
      "line_four": "It is never a mistake to retreat to a stronger position.",
      "line_five": "The seasoned veteran is elevated to command, and none too soon. For the game is in the field, and it would be wise to catch it.",
      "line_six": "The victor divides the spoils among the loyal, leaving the jackals with neither reward nor obligation."
    },
    {
      "id": 18,
      "name": "Pi / Bonding",
      "description": "Deep Waters on the face of the Earth: Surface waters flow together. The Superior Person recognizes the situation calls for joining together. Thus he cultivates friendly relations with all.  Good fortune is possible. Cast the coins again to discover if you have the qualities needed to lead such a group. Then there will be no error. Those uncertain will gradually join. Those who join too late will meet with misfortune.  SITUATION ANALYSIS: This is a time of connection with another or others -- not just an alliance, but a melding of parts into a new whole. Such a connection may be too close, too intense for some. Consult the oracle again to see if you have the qualities needed to strengthen and withstand such an intense synthesis. ",
      "line_one": "Confidently and sincerely seeking union. His devotion to you and to truth makes this alliance correct.  Unexpected good fortune.",
      "line_two": "Devotion comes from deep inside you. Good fortune if you keep to your course.",
      "line_three": "You are seeking union with unworthy people.",
      "line_four": "You express your devotion humbly and openly. Good fortune if you keep to this course.",
      "line_five": "The hunter surrounds the game on only three sides, allowing an avenue of escape. In seeking allegiance with others, leave room for them to say 'no'; this way, those choosing to join you will be sincere.",
      "line_six": "Without a head, the union cannot hold together. Misfortune."
    },
    {
      "id": 19,
      "name": "Hsiao Ch'u / Gentle Restraint",
      "description": "Winds of change high in the Heavens: Air currents carry the weather. Dense clouds blow in from the West, but still no rain. The Superior Person fine tunes the image he presents to the world.  Small successes.  SITUATION ANALYSIS: No matter what you do, the fruit of your labors never seems to ripen. Your reward remains just out of reach. Men have gone mad from such anticipation. Don't lose your balance lunging for the brass ring. While the Fates continue to restrain you, go them one better and display a self-generated restraint and grace. Look for the humor in the situation. ",
      "line_one": "He turns back to his proper course. No harm done. In fact, good fortune comes of this return.",
      "line_two": "He lets himself be drawn back. Good fortune.",
      "line_three": "The spokes burst out of a wagon wheel, stopping the couple's journey. The man and wife waste time and energy blaming each other, causing major damage to their love instead of fixing the minor damage to the wagon.",
      "line_four": "By gaining confidence, the man keeps control of the conflict, avoiding the blood that could be spilled by fear. No mistakes.",
      "line_five": "His sincerity is the cord that binds the hearts of others to his. He holds wealth who holds the hearts of others. ",
      "line_six": "The needed rain finally pours down, bringing a well-earned time of rest. It is Nature's time to enrich the crops, so leave it to her. To work the fields in the rain and mud would only undo all good effort. Do not seek more; the gibbous moon seeks to be full, but once full can do nothing but wane."
    },
    {
      "id": 20,
      "name": "Lü / Worrying the Tiger",
      "description": "Heaven shines down on the Marsh which reflects it back imperfectly: Though the Superior Man carefully discriminates between high and low, and acts in accord with the flow of the Tao, there are still situations where a risk must be taken.  You tread upon the tail of the tiger. Not perceiving you as a threat, the startled tiger does not bite. Success.  SITUATION ANALYSIS: You have reached a perilous point in your journey. This is a real gamble -- not a maneuver, not a calculated risk. The outcome is uncertain. If it goes as you hope, you will gain -- but if it turns against you it will cause serious injury, at least to your plans. The best tack is extreme caution and a healthy respect for the danger involved.  Winds of change high in the Heavens: Air currents carry the weather. Dense clouds blow in from the West, but still no rain. The Superior Person fine tunes the image he presents to the world.  Small successes.  SITUATION ANALYSIS: No matter what you do, the fruit of your labors never seems to ripen. Your reward remains just out of reach. Men have gone mad from such anticipation. Don't lose your balance lunging for the brass ring. While the Fates continue to restrain you, go them one better and display a self-generated restraint and grace. Look for the humor in the situation. ",
      "line_one": "He treads the simple path of least resistance, making swift and blameless progress.",
      "line_two": "A man of modest independence treads a smooth and level path. Good fortune if you stay on course.",
      "line_three": "A one-eyed man may still see, a lame man may still walk, but it takes every resource to circumvent the tiger. When this tiger is stepped on he bites. Only a warrior supremely loyal to his cause would enter a battle he knows he hasn't the resources to survive.",
      "line_four": "He shows humble hesitation and breathless caution, yet still resolutely takes a necessary step on the tail of the tiger. His modest manner saves him from the bite.",
      "line_five": "Though fully aware of the danger that lies on the narrow path ahead, the man is fully commited to move forward. The future is uncertain.",
      "line_six": "At your journey's end, look back and examine the path you chose. If you find no causes for shame, only good works that make you shine, you may take this as an omen of the certainty of great reward."
    },
    {
      "id": 21,
      "name": "Ch'ien / Creative Activity",
      "description": "Heaven above and Heaven below: Heaven in constant motion. With the strength of the dragon, the Superior Person steels himself for ceaseless activity.  Productive Activity. Potent Influence. Sublime Success if you keep to your course.  SITUATION ANALYSIS: The time for action has come. You now have the focus and the stamina necessary for accomplishing great tasks. The path before you is being cleared and reward lies ahead. ",
      "line_one": "The dragon remains beneath the surface. Do not act.",
      "line_two": "The dragon climbs to the surface. Seek advice from an authority you respect.",
      "line_three": "The Superior Person builds by day and remains vigilant through the night. Danger, but he will persevere.",
      "line_four": "The flying dragon hovers over the chasm from which he was born.",
      "line_five": "The dragon rises high for all to see. He has become the mentor he always longed to find.",
      "line_six": "Even a dragon may fly too high."
    },
    {
      "id": 22,
      "name": "K'un / Receptive Force",
      "description": "Earth above and Earth below: The Earth contains and sustains. In this situation, the Superior Person should not take the initiative; he should follow the initiative of another. He should seek receptive allies in the southwest; he should break ties with immovable allies in the northeast.  Responsive devotion. Receptive influence. Sublime Success if you keep to your course.  SITUATION ANALYSIS: This is a time for dealing with reality as it is, not as you would have it be. If you realize that in this situation you are the receptor, not the transmitter of the stimulus, you will find yourself reaching goals that seemed unattainable under your own steam. If you persist in futile efforts to be the Shaper rather than the Shaped, you will completely miss this unique opportunity. ",
      "line_one": "When frost crunches underfoot can winter ice be far behind?",
      "line_two": "Straight, square, and true. By being instead of doing, nothing is left undone.",
      "line_three": "Hide your brilliance. Feeling no threat, they won't resist the completion of your goal. All you lose is credit for the accomplishment.",
      "line_four": "Be a tied-up sack, letting your inner contents remain unseen. There will be no praise, but also no blame.",
      "line_five": "A yellow robe. Supreme good fortune.",
      "line_six": "The battling dragons are too evenly matched. Each spills black and yellow blood to the soil below."
    },
    {
      "id": 23,
      "name": "Chun / Difficulty at the Beginning",
      "description": "Thunder from the Deep: The Superior Person carefully weaves order out of confusion.  Supreme Success if you keep to your course. Carefully consider the first move. Seek help.  SITUATION ANALYSIS: New ventures always pack along their inherent chaos. Though this is an annoyance at best, and can even imperil or downright doom an endeavor, it is also the friction needed to polish your project to jewel brilliance. Learn from these early obstacles. ",
      "line_one": "You have run up against an obstacle at the very head of the trail. Keep to your course. Seek mutual aid.",
      "line_two": "Her horses rear in fright; but the highwayman means no harm. He seeks only the hand of the maiden. She must refuse him, for she fears a very long journey lies ahead before she can marry.",
      "line_three": "A hunter who pursues his prey without a guide will lose his way in the deeps of the forest. The Superior Person knows his limitations and gives up the chase. To advance brings regret.",
      "line_four": "Her horses break away. Turning back, she must learn to trust, and accept the escort of her spurned highwayman. What seemed at first misfortune will lead to marriage.",
      "line_five": "He could rescue them, if only they would trust. For now, he must provide protection and small comfort from the shadows.",
      "line_six": "The horses break free. If the need for aid goes unrecognized, tears and blood will flow."
    },
    {
      "id": 24,
      "name": "Mêng / Inexperience",
      "description": "A fresh Spring at the foot of the Mountain: The Superior Person refines his character by being thorough in every activity. The Sage does not recruit students; the students seek him. He asks nothing but a sincere desire to learn. If the student doubts or challenges his authority, the Sage regretfully cuts his losses.  SITUATION ANALYSIS: This is a time of interchange between a mentor and pupil. Whether you are the teacher or the student, it is a time of companionship along a mutual path. This hexagram also emphasizes the eternal, cyclical nature of the mentor/student relationship -- a mentor is merely a more seasoned pupil, further along on the journey. A pupil holds within himself the seed of a future Master. ",
      "line_one": "A little discipline will make the fool sit up and take notice. Afterwards, the matter should be dropped, or some will question which is the master and which the fool.",
      "line_two": "The man is gentle with the misguided and understands the hearts of women.  Such a one can be trusted with the kingdom.",
      "line_three": "No one respects a lovestruck woman who throws herself at the object of her desire. Do not idolize.",
      "line_four": "You are so terrified of being wrong, you leave no room for learning what is right.",
      "line_five": "Like a wide-eyed child, you wholly and naively trust the goodness of others. Such honor brings out their best.",
      "line_six": " The best way to prove a fool wrong is to let him have his way. To severely restrict his folly will invite him to always believe that his way would have been right."
    },
    {
      "id": 25,
      "name": "Hsü / Calculated Waiting",
      "description": " Deep Waters in the Heavens: Thunderclouds approaching from the West, but no rain yet. The Superior Person nourishes himself and remains of good cheer to condition himself for the moment of truth.  Great Success if you sincerely keep to your course. You may cross to the far shore.  SITUATION ANALYSIS: You must now endure this Dangling -- either a carrot before your nose, or a sword above your head. This strange mix of apprehension and anticipation is a Purgatory. There is nothing more you can do to affect the outcome. You must now submit to the Fates. ",
      "line_one": "No trouble in sight, but vague anxieties about what lies beyond the horizon. Whether real or not, the threat has already won your peace of mind.",
      "line_two": "Taking your post in the sand, ceaselessly watching the far shore for enemy movements, you must endure the taunts and contempt of your comrades. Good fortune in the end.",
      "line_three": "Anxiety prods you to premature action. Wading into the river, you become mired in the bed of mud. Not only does the enemy realize you detect them, but they see your vulnerability as an opportunity to strike.",
      "line_four": "The enemy is upon you. You wait in blood, preparing yourself for their blows; but your own ability can see you through, if you stand your ground and maintain balance.",
      "line_five": "You smile and join in the banquet, relaxing and gaining perspective, yet vigilant and prepared for the next onslaught. Such genuine grace under pressure ensures victory and good fortune.",
      "line_six": "The showdown comes, with the opponents too evenly matched. Just as all hopes of survival are dashed, three strangers appear. They will tip the scales in favor of the contender who recognizes them for what they are."
    },
    {
      "id": 26,
      "name": "Sung / Conflict",
      "description": "The high Heavens over a yawning Deep chasm: An expansive void where nothing can dwell. Even though he sincerely knows he is right, the Superior Person anticipates opposition and carefully prepares for any incident.  Good fortune if your conflict results in compromise. Misfortune if your conflict escalates to confrontation. Seek advice. Postpone your crossing to the far shore.  SITUATION ANALYSIS: Conflict is a necessary part of life. Tension upon the strings of a violin can make majestic music. The critical mass of two hydrogen atoms trying to occupy the same space fuel the sun that nourishes our solar system. Most conflicts you face in life are the result of your Path converging with another's. Your Path is not his, and one Path is not necessarily more right than the other. Can you work together to remove the blockage? ",
      "line_one": "No quarrel will blossom, unless you let your pride fertilize this budding conflict. Let the one who insults you expose himself for what he is. Don't fight this battle until you've already won it.",
      "line_two": "Knowing his comrades would be annihilated against their much stronger foe, he orders a full retreat, retires into seclusion, and is condemned by the very neighbors he saved from ruin.",
      "line_three": "He stands on his integrity, no matter what ill winds may blast him. Stand or fall, in the end he will remain exactly who he is.",
      "line_four": "Realizing the very root of conflict lies within his own heart, he lays down his arms and resolves to accept the things he cannot change.",
      "line_five": "Bring the conflict before a just authority. If you are truly in the right, justice will bring good fortune.",
      "line_six": "You can certainly win this conflict. Such a victory, though, will bring a lifetime of defending your prize against thieves and challengers."
    },
    {
      "id": 27,
      "name": "Shih / Recruiting Allies",
      "description": "Deep Water beneath the Earth's surface: Untapped resources are available. The Superior Person nourishes and instructs the people, building a loyal, disciplined following. Good fortune. No mistakes if you follow a course led by experience.  SITUATION ANALYSIS: You must gain support from others. Find a way to make others want to see your objectives met as badly as you want it. How can they profit from the attainment of this goal? Can you command confidence that you are just the person that can bring this plan to fruition? ",
      "line_one": "Knowing neither purpose nor direction, the soldiers march blindly onward.",
      "line_two": "The general marches with his soldiers, sharing their fate, good or bad, facing the consequences of his own decisions. For this he is loved and trusted by all.",
      "line_three": "A wagonload of corpses this way comes.",
      "line_four": "It is never a mistake to retreat to a stronger position.",
      "line_five": "The seasoned veteran is elevated to command, and none too soon. For the game is in the field, and it would be wise to catch it.",
      "line_six": "The victor divides the spoils among the loyal, leaving the jackals with neither reward nor obligation."
    },
    {
      "id": 28,
      "name": "Pi / Bonding",
      "description": "Deep Waters on the face of the Earth: Surface waters flow together. The Superior Person recognizes the situation calls for joining together. Thus he cultivates friendly relations with all.  Good fortune is possible. Cast the coins again to discover if you have the qualities needed to lead such a group. Then there will be no error. Those uncertain will gradually join. Those who join too late will meet with misfortune.  SITUATION ANALYSIS: This is a time of connection with another or others -- not just an alliance, but a melding of parts into a new whole. Such a connection may be too close, too intense for some. Consult the oracle again to see if you have the qualities needed to strengthen and withstand such an intense synthesis. ",
      "line_one": "Confidently and sincerely seeking union. His devotion to you and to truth makes this alliance correct.  Unexpected good fortune.",
      "line_two": "Devotion comes from deep inside you. Good fortune if you keep to your course.",
      "line_three": "You are seeking union with unworthy people.",
      "line_four": "You express your devotion humbly and openly. Good fortune if you keep to this course.",
      "line_five": "The hunter surrounds the game on only three sides, allowing an avenue of escape. In seeking allegiance with others, leave room for them to say 'no'; this way, those choosing to join you will be sincere.",
      "line_six": "Without a head, the union cannot hold together. Misfortune."
    },
    {
      "id": 29,
      "name": "Hsiao Ch'u / Gentle Restraint",
      "description": "Winds of change high in the Heavens: Air currents carry the weather. Dense clouds blow in from the West, but still no rain. The Superior Person fine tunes the image he presents to the world.  Small successes.  SITUATION ANALYSIS: No matter what you do, the fruit of your labors never seems to ripen. Your reward remains just out of reach. Men have gone mad from such anticipation. Don't lose your balance lunging for the brass ring. While the Fates continue to restrain you, go them one better and display a self-generated restraint and grace. Look for the humor in the situation. ",
      "line_one": "He turns back to his proper course. No harm done. In fact, good fortune comes of this return.",
      "line_two": "He lets himself be drawn back. Good fortune.",
      "line_three": "The spokes burst out of a wagon wheel, stopping the couple's journey. The man and wife waste time and energy blaming each other, causing major damage to their love instead of fixing the minor damage to the wagon.",
      "line_four": "By gaining confidence, the man keeps control of the conflict, avoiding the blood that could be spilled by fear. No mistakes.",
      "line_five": "His sincerity is the cord that binds the hearts of others to his. He holds wealth who holds the hearts of others. ",
      "line_six": "The needed rain finally pours down, bringing a well-earned time of rest. It is Nature's time to enrich the crops, so leave it to her. To work the fields in the rain and mud would only undo all good effort. Do not seek more; the gibbous moon seeks to be full, but once full can do nothing but wane."
    },
    {
      "id": 30,
      "name": "Lü / Worrying the Tiger",
      "description": "Heaven shines down on the Marsh which reflects it back imperfectly: Though the Superior Man carefully discriminates between high and low, and acts in accord with the flow of the Tao, there are still situations where a risk must be taken.  You tread upon the tail of the tiger. Not perceiving you as a threat, the startled tiger does not bite. Success.  SITUATION ANALYSIS: You have reached a perilous point in your journey. This is a real gamble -- not a maneuver, not a calculated risk. The outcome is uncertain. If it goes as you hope, you will gain -- but if it turns against you it will cause serious injury, at least to your plans. The best tack is extreme caution and a healthy respect for the danger involved.  Winds of change high in the Heavens: Air currents carry the weather. Dense clouds blow in from the West, but still no rain. The Superior Person fine tunes the image he presents to the world.  Small successes.  SITUATION ANALYSIS: No matter what you do, the fruit of your labors never seems to ripen. Your reward remains just out of reach. Men have gone mad from such anticipation. Don't lose your balance lunging for the brass ring. While the Fates continue to restrain you, go them one better and display a self-generated restraint and grace. Look for the humor in the situation. ",
      "line_one": "He treads the simple path of least resistance, making swift and blameless progress.",
      "line_two": "A man of modest independence treads a smooth and level path. Good fortune if you stay on course.",
      "line_three": "A one-eyed man may still see, a lame man may still walk, but it takes every resource to circumvent the tiger. When this tiger is stepped on he bites. Only a warrior supremely loyal to his cause would enter a battle he knows he hasn't the resources to survive.",
      "line_four": "He shows humble hesitation and breathless caution, yet still resolutely takes a necessary step on the tail of the tiger. His modest manner saves him from the bite.",
      "line_five": "Though fully aware of the danger that lies on the narrow path ahead, the man is fully commited to move forward. The future is uncertain.",
      "line_six": "At your journey's end, look back and examine the path you chose. If you find no causes for shame, only good works that make you shine, you may take this as an omen of the certainty of great reward."
    },
    {
      "id": 31,
      "name": "Ch'ien / Creative Activity",
      "description": "Heaven above and Heaven below: Heaven in constant motion. With the strength of the dragon, the Superior Person steels himself for ceaseless activity.  Productive Activity. Potent Influence. Sublime Success if you keep to your course.  SITUATION ANALYSIS: The time for action has come. You now have the focus and the stamina necessary for accomplishing great tasks. The path before you is being cleared and reward lies ahead. ",
      "line_one": "The dragon remains beneath the surface. Do not act.",
      "line_two": "The dragon climbs to the surface. Seek advice from an authority you respect.",
      "line_three": "The Superior Person builds by day and remains vigilant through the night. Danger, but he will persevere.",
      "line_four": "The flying dragon hovers over the chasm from which he was born.",
      "line_five": "The dragon rises high for all to see. He has become the mentor he always longed to find.",
      "line_six": "Even a dragon may fly too high."
    },
    {
      "id": 32,
      "name": "K'un / Receptive Force",
      "description": "Earth above and Earth below: The Earth contains and sustains. In this situation, the Superior Person should not take the initiative; he should follow the initiative of another. He should seek receptive allies in the southwest; he should break ties with immovable allies in the northeast.  Responsive devotion. Receptive influence. Sublime Success if you keep to your course.  SITUATION ANALYSIS: This is a time for dealing with reality as it is, not as you would have it be. If you realize that in this situation you are the receptor, not the transmitter of the stimulus, you will find yourself reaching goals that seemed unattainable under your own steam. If you persist in futile efforts to be the Shaper rather than the Shaped, you will completely miss this unique opportunity. ",
      "line_one": "When frost crunches underfoot can winter ice be far behind?",
      "line_two": "Straight, square, and true. By being instead of doing, nothing is left undone.",
      "line_three": "Hide your brilliance. Feeling no threat, they won't resist the completion of your goal. All you lose is credit for the accomplishment.",
      "line_four": "Be a tied-up sack, letting your inner contents remain unseen. There will be no praise, but also no blame.",
      "line_five": "A yellow robe. Supreme good fortune.",
      "line_six": "The battling dragons are too evenly matched. Each spills black and yellow blood to the soil below."
    },
    {
      "id": 33,
      "name": "Chun / Difficulty at the Beginning",
      "description": "Thunder from the Deep: The Superior Person carefully weaves order out of confusion.  Supreme Success if you keep to your course. Carefully consider the first move. Seek help.  SITUATION ANALYSIS: New ventures always pack along their inherent chaos. Though this is an annoyance at best, and can even imperil or downright doom an endeavor, it is also the friction needed to polish your project to jewel brilliance. Learn from these early obstacles. ",
      "line_one": "You have run up against an obstacle at the very head of the trail. Keep to your course. Seek mutual aid.",
      "line_two": "Her horses rear in fright; but the highwayman means no harm. He seeks only the hand of the maiden. She must refuse him, for she fears a very long journey lies ahead before she can marry.",
      "line_three": "A hunter who pursues his prey without a guide will lose his way in the deeps of the forest. The Superior Person knows his limitations and gives up the chase. To advance brings regret.",
      "line_four": "Her horses break away. Turning back, she must learn to trust, and accept the escort of her spurned highwayman. What seemed at first misfortune will lead to marriage.",
      "line_five": "He could rescue them, if only they would trust. For now, he must provide protection and small comfort from the shadows.",
      "line_six": "The horses break free. If the need for aid goes unrecognized, tears and blood will flow."
    },
    {
      "id": 34,
      "name": "Mêng / Inexperience",
      "description": "A fresh Spring at the foot of the Mountain: The Superior Person refines his character by being thorough in every activity. The Sage does not recruit students; the students seek him. He asks nothing but a sincere desire to learn. If the student doubts or challenges his authority, the Sage regretfully cuts his losses.  SITUATION ANALYSIS: This is a time of interchange between a mentor and pupil. Whether you are the teacher or the student, it is a time of companionship along a mutual path. This hexagram also emphasizes the eternal, cyclical nature of the mentor/student relationship -- a mentor is merely a more seasoned pupil, further along on the journey. A pupil holds within himself the seed of a future Master. ",
      "line_one": "A little discipline will make the fool sit up and take notice. Afterwards, the matter should be dropped, or some will question which is the master and which the fool.",
      "line_two": "The man is gentle with the misguided and understands the hearts of women.  Such a one can be trusted with the kingdom.",
      "line_three": "No one respects a lovestruck woman who throws herself at the object of her desire. Do not idolize.",
      "line_four": "You are so terrified of being wrong, you leave no room for learning what is right.",
      "line_five": "Like a wide-eyed child, you wholly and naively trust the goodness of others. Such honor brings out their best.",
      "line_six": " The best way to prove a fool wrong is to let him have his way. To severely restrict his folly will invite him to always believe that his way would have been right."
    },
    {
      "id": 35,
      "name": "Hsü / Calculated Waiting",
      "description": " Deep Waters in the Heavens: Thunderclouds approaching from the West, but no rain yet. The Superior Person nourishes himself and remains of good cheer to condition himself for the moment of truth.  Great Success if you sincerely keep to your course. You may cross to the far shore.  SITUATION ANALYSIS: You must now endure this Dangling -- either a carrot before your nose, or a sword above your head. This strange mix of apprehension and anticipation is a Purgatory. There is nothing more you can do to affect the outcome. You must now submit to the Fates. ",
      "line_one": "No trouble in sight, but vague anxieties about what lies beyond the horizon. Whether real or not, the threat has already won your peace of mind.",
      "line_two": "Taking your post in the sand, ceaselessly watching the far shore for enemy movements, you must endure the taunts and contempt of your comrades. Good fortune in the end.",
      "line_three": "Anxiety prods you to premature action. Wading into the river, you become mired in the bed of mud. Not only does the enemy realize you detect them, but they see your vulnerability as an opportunity to strike.",
      "line_four": "The enemy is upon you. You wait in blood, preparing yourself for their blows; but your own ability can see you through, if you stand your ground and maintain balance.",
      "line_five": "You smile and join in the banquet, relaxing and gaining perspective, yet vigilant and prepared for the next onslaught. Such genuine grace under pressure ensures victory and good fortune.",
      "line_six": "The showdown comes, with the opponents too evenly matched. Just as all hopes of survival are dashed, three strangers appear. They will tip the scales in favor of the contender who recognizes them for what they are."
    },
    {
      "id": 36,
      "name": "Sung / Conflict",
      "description": "The high Heavens over a yawning Deep chasm: An expansive void where nothing can dwell. Even though he sincerely knows he is right, the Superior Person anticipates opposition and carefully prepares for any incident.  Good fortune if your conflict results in compromise. Misfortune if your conflict escalates to confrontation. Seek advice. Postpone your crossing to the far shore.  SITUATION ANALYSIS: Conflict is a necessary part of life. Tension upon the strings of a violin can make majestic music. The critical mass of two hydrogen atoms trying to occupy the same space fuel the sun that nourishes our solar system. Most conflicts you face in life are the result of your Path converging with another's. Your Path is not his, and one Path is not necessarily more right than the other. Can you work together to remove the blockage? ",
      "line_one": "No quarrel will blossom, unless you let your pride fertilize this budding conflict. Let the one who insults you expose himself for what he is. Don't fight this battle until you've already won it.",
      "line_two": "Knowing his comrades would be annihilated against their much stronger foe, he orders a full retreat, retires into seclusion, and is condemned by the very neighbors he saved from ruin.",
      "line_three": "He stands on his integrity, no matter what ill winds may blast him. Stand or fall, in the end he will remain exactly who he is.",
      "line_four": "Realizing the very root of conflict lies within his own heart, he lays down his arms and resolves to accept the things he cannot change.",
      "line_five": "Bring the conflict before a just authority. If you are truly in the right, justice will bring good fortune.",
      "line_six": "You can certainly win this conflict. Such a victory, though, will bring a lifetime of defending your prize against thieves and challengers."
    },
    {
      "id": 37,
      "name": "Shih / Recruiting Allies",
      "description": "Deep Water beneath the Earth's surface: Untapped resources are available. The Superior Person nourishes and instructs the people, building a loyal, disciplined following. Good fortune. No mistakes if you follow a course led by experience.  SITUATION ANALYSIS: You must gain support from others. Find a way to make others want to see your objectives met as badly as you want it. How can they profit from the attainment of this goal? Can you command confidence that you are just the person that can bring this plan to fruition? ",
      "line_one": "Knowing neither purpose nor direction, the soldiers march blindly onward.",
      "line_two": "The general marches with his soldiers, sharing their fate, good or bad, facing the consequences of his own decisions. For this he is loved and trusted by all.",
      "line_three": "A wagonload of corpses this way comes.",
      "line_four": "It is never a mistake to retreat to a stronger position.",
      "line_five": "The seasoned veteran is elevated to command, and none too soon. For the game is in the field, and it would be wise to catch it.",
      "line_six": "The victor divides the spoils among the loyal, leaving the jackals with neither reward nor obligation."
    },
    {
      "id": 38,
      "name": "Pi / Bonding",
      "description": "Deep Waters on the face of the Earth: Surface waters flow together. The Superior Person recognizes the situation calls for joining together. Thus he cultivates friendly relations with all.  Good fortune is possible. Cast the coins again to discover if you have the qualities needed to lead such a group. Then there will be no error. Those uncertain will gradually join. Those who join too late will meet with misfortune.  SITUATION ANALYSIS: This is a time of connection with another or others -- not just an alliance, but a melding of parts into a new whole. Such a connection may be too close, too intense for some. Consult the oracle again to see if you have the qualities needed to strengthen and withstand such an intense synthesis. ",
      "line_one": "Confidently and sincerely seeking union. His devotion to you and to truth makes this alliance correct.  Unexpected good fortune.",
      "line_two": "Devotion comes from deep inside you. Good fortune if you keep to your course.",
      "line_three": "You are seeking union with unworthy people.",
      "line_four": "You express your devotion humbly and openly. Good fortune if you keep to this course.",
      "line_five": "The hunter surrounds the game on only three sides, allowing an avenue of escape. In seeking allegiance with others, leave room for them to say 'no'; this way, those choosing to join you will be sincere.",
      "line_six": "Without a head, the union cannot hold together. Misfortune."
    },
    {
      "id": 39,
      "name": "Hsiao Ch'u / Gentle Restraint",
      "description": "Winds of change high in the Heavens: Air currents carry the weather. Dense clouds blow in from the West, but still no rain. The Superior Person fine tunes the image he presents to the world.  Small successes.  SITUATION ANALYSIS: No matter what you do, the fruit of your labors never seems to ripen. Your reward remains just out of reach. Men have gone mad from such anticipation. Don't lose your balance lunging for the brass ring. While the Fates continue to restrain you, go them one better and display a self-generated restraint and grace. Look for the humor in the situation. ",
      "line_one": "He turns back to his proper course. No harm done. In fact, good fortune comes of this return.",
      "line_two": "He lets himself be drawn back. Good fortune.",
      "line_three": "The spokes burst out of a wagon wheel, stopping the couple's journey. The man and wife waste time and energy blaming each other, causing major damage to their love instead of fixing the minor damage to the wagon.",
      "line_four": "By gaining confidence, the man keeps control of the conflict, avoiding the blood that could be spilled by fear. No mistakes.",
      "line_five": "His sincerity is the cord that binds the hearts of others to his. He holds wealth who holds the hearts of others. ",
      "line_six": "The needed rain finally pours down, bringing a well-earned time of rest. It is Nature's time to enrich the crops, so leave it to her. To work the fields in the rain and mud would only undo all good effort. Do not seek more; the gibbous moon seeks to be full, but once full can do nothing but wane."
    },
    {
      "id": 40,
      "name": "Lü / Worrying the Tiger",
      "description": "Heaven shines down on the Marsh which reflects it back imperfectly: Though the Superior Man carefully discriminates between high and low, and acts in accord with the flow of the Tao, there are still situations where a risk must be taken.  You tread upon the tail of the tiger. Not perceiving you as a threat, the startled tiger does not bite. Success.  SITUATION ANALYSIS: You have reached a perilous point in your journey. This is a real gamble -- not a maneuver, not a calculated risk. The outcome is uncertain. If it goes as you hope, you will gain -- but if it turns against you it will cause serious injury, at least to your plans. The best tack is extreme caution and a healthy respect for the danger involved.  Winds of change high in the Heavens: Air currents carry the weather. Dense clouds blow in from the West, but still no rain. The Superior Person fine tunes the image he presents to the world.  Small successes.  SITUATION ANALYSIS: No matter what you do, the fruit of your labors never seems to ripen. Your reward remains just out of reach. Men have gone mad from such anticipation. Don't lose your balance lunging for the brass ring. While the Fates continue to restrain you, go them one better and display a self-generated restraint and grace. Look for the humor in the situation. ",
      "line_one": "He treads the simple path of least resistance, making swift and blameless progress.",
      "line_two": "A man of modest independence treads a smooth and level path. Good fortune if you stay on course.",
      "line_three": "A one-eyed man may still see, a lame man may still walk, but it takes every resource to circumvent the tiger. When this tiger is stepped on he bites. Only a warrior supremely loyal to his cause would enter a battle he knows he hasn't the resources to survive.",
      "line_four": "He shows humble hesitation and breathless caution, yet still resolutely takes a necessary step on the tail of the tiger. His modest manner saves him from the bite.",
      "line_five": "Though fully aware of the danger that lies on the narrow path ahead, the man is fully commited to move forward. The future is uncertain.",
      "line_six": "At your journey's end, look back and examine the path you chose. If you find no causes for shame, only good works that make you shine, you may take this as an omen of the certainty of great reward."
    },
    {
      "id": 41,
      "name": "Ch'ien / Creative Activity",
      "description": "Heaven above and Heaven below: Heaven in constant motion. With the strength of the dragon, the Superior Person steels himself for ceaseless activity.  Productive Activity. Potent Influence. Sublime Success if you keep to your course.  SITUATION ANALYSIS: The time for action has come. You now have the focus and the stamina necessary for accomplishing great tasks. The path before you is being cleared and reward lies ahead. ",
      "line_one": "The dragon remains beneath the surface. Do not act.",
      "line_two": "The dragon climbs to the surface. Seek advice from an authority you respect.",
      "line_three": "The Superior Person builds by day and remains vigilant through the night. Danger, but he will persevere.",
      "line_four": "The flying dragon hovers over the chasm from which he was born.",
      "line_five": "The dragon rises high for all to see. He has become the mentor he always longed to find.",
      "line_six": "Even a dragon may fly too high."
    },
    {
      "id": 42,
      "name": "K'un / Receptive Force",
      "description": "Earth above and Earth below: The Earth contains and sustains. In this situation, the Superior Person should not take the initiative; he should follow the initiative of another. He should seek receptive allies in the southwest; he should break ties with immovable allies in the northeast.  Responsive devotion. Receptive influence. Sublime Success if you keep to your course.  SITUATION ANALYSIS: This is a time for dealing with reality as it is, not as you would have it be. If you realize that in this situation you are the receptor, not the transmitter of the stimulus, you will find yourself reaching goals that seemed unattainable under your own steam. If you persist in futile efforts to be the Shaper rather than the Shaped, you will completely miss this unique opportunity. ",
      "line_one": "When frost crunches underfoot can winter ice be far behind?",
      "line_two": "Straight, square, and true. By being instead of doing, nothing is left undone.",
      "line_three": "Hide your brilliance. Feeling no threat, they won't resist the completion of your goal. All you lose is credit for the accomplishment.",
      "line_four": "Be a tied-up sack, letting your inner contents remain unseen. There will be no praise, but also no blame.",
      "line_five": "A yellow robe. Supreme good fortune.",
      "line_six": "The battling dragons are too evenly matched. Each spills black and yellow blood to the soil below."
    },
    {
      "id": 43,
      "name": "Chun / Difficulty at the Beginning",
      "description": "Thunder from the Deep: The Superior Person carefully weaves order out of confusion.  Supreme Success if you keep to your course. Carefully consider the first move. Seek help.  SITUATION ANALYSIS: New ventures always pack along their inherent chaos. Though this is an annoyance at best, and can even imperil or downright doom an endeavor, it is also the friction needed to polish your project to jewel brilliance. Learn from these early obstacles. ",
      "line_one": "You have run up against an obstacle at the very head of the trail. Keep to your course. Seek mutual aid.",
      "line_two": "Her horses rear in fright; but the highwayman means no harm. He seeks only the hand of the maiden. She must refuse him, for she fears a very long journey lies ahead before she can marry.",
      "line_three": "A hunter who pursues his prey without a guide will lose his way in the deeps of the forest. The Superior Person knows his limitations and gives up the chase. To advance brings regret.",
      "line_four": "Her horses break away. Turning back, she must learn to trust, and accept the escort of her spurned highwayman. What seemed at first misfortune will lead to marriage.",
      "line_five": "He could rescue them, if only they would trust. For now, he must provide protection and small comfort from the shadows.",
      "line_six": "The horses break free. If the need for aid goes unrecognized, tears and blood will flow."
    },
    {
      "id": 44,
      "name": "Mêng / Inexperience",
      "description": "A fresh Spring at the foot of the Mountain: The Superior Person refines his character by being thorough in every activity. The Sage does not recruit students; the students seek him. He asks nothing but a sincere desire to learn. If the student doubts or challenges his authority, the Sage regretfully cuts his losses.  SITUATION ANALYSIS: This is a time of interchange between a mentor and pupil. Whether you are the teacher or the student, it is a time of companionship along a mutual path. This hexagram also emphasizes the eternal, cyclical nature of the mentor/student relationship -- a mentor is merely a more seasoned pupil, further along on the journey. A pupil holds within himself the seed of a future Master. ",
      "line_one": "A little discipline will make the fool sit up and take notice. Afterwards, the matter should be dropped, or some will question which is the master and which the fool.",
      "line_two": "The man is gentle with the misguided and understands the hearts of women.  Such a one can be trusted with the kingdom.",
      "line_three": "No one respects a lovestruck woman who throws herself at the object of her desire. Do not idolize.",
      "line_four": "You are so terrified of being wrong, you leave no room for learning what is right.",
      "line_five": "Like a wide-eyed child, you wholly and naively trust the goodness of others. Such honor brings out their best.",
      "line_six": " The best way to prove a fool wrong is to let him have his way. To severely restrict his folly will invite him to always believe that his way would have been right."
    },
    {
      "id": 45,
      "name": "Hsü / Calculated Waiting",
      "description": " Deep Waters in the Heavens: Thunderclouds approaching from the West, but no rain yet. The Superior Person nourishes himself and remains of good cheer to condition himself for the moment of truth.  Great Success if you sincerely keep to your course. You may cross to the far shore.  SITUATION ANALYSIS: You must now endure this Dangling -- either a carrot before your nose, or a sword above your head. This strange mix of apprehension and anticipation is a Purgatory. There is nothing more you can do to affect the outcome. You must now submit to the Fates. ",
      "line_one": "No trouble in sight, but vague anxieties about what lies beyond the horizon. Whether real or not, the threat has already won your peace of mind.",
      "line_two": "Taking your post in the sand, ceaselessly watching the far shore for enemy movements, you must endure the taunts and contempt of your comrades. Good fortune in the end.",
      "line_three": "Anxiety prods you to premature action. Wading into the river, you become mired in the bed of mud. Not only does the enemy realize you detect them, but they see your vulnerability as an opportunity to strike.",
      "line_four": "The enemy is upon you. You wait in blood, preparing yourself for their blows; but your own ability can see you through, if you stand your ground and maintain balance.",
      "line_five": "You smile and join in the banquet, relaxing and gaining perspective, yet vigilant and prepared for the next onslaught. Such genuine grace under pressure ensures victory and good fortune.",
      "line_six": "The showdown comes, with the opponents too evenly matched. Just as all hopes of survival are dashed, three strangers appear. They will tip the scales in favor of the contender who recognizes them for what they are."
    },
    {
      "id": 46,
      "name": "Sung / Conflict",
      "description": "The high Heavens over a yawning Deep chasm: An expansive void where nothing can dwell. Even though he sincerely knows he is right, the Superior Person anticipates opposition and carefully prepares for any incident.  Good fortune if your conflict results in compromise. Misfortune if your conflict escalates to confrontation. Seek advice. Postpone your crossing to the far shore.  SITUATION ANALYSIS: Conflict is a necessary part of life. Tension upon the strings of a violin can make majestic music. The critical mass of two hydrogen atoms trying to occupy the same space fuel the sun that nourishes our solar system. Most conflicts you face in life are the result of your Path converging with another's. Your Path is not his, and one Path is not necessarily more right than the other. Can you work together to remove the blockage? ",
      "line_one": "No quarrel will blossom, unless you let your pride fertilize this budding conflict. Let the one who insults you expose himself for what he is. Don't fight this battle until you've already won it.",
      "line_two": "Knowing his comrades would be annihilated against their much stronger foe, he orders a full retreat, retires into seclusion, and is condemned by the very neighbors he saved from ruin.",
      "line_three": "He stands on his integrity, no matter what ill winds may blast him. Stand or fall, in the end he will remain exactly who he is.",
      "line_four": "Realizing the very root of conflict lies within his own heart, he lays down his arms and resolves to accept the things he cannot change.",
      "line_five": "Bring the conflict before a just authority. If you are truly in the right, justice will bring good fortune.",
      "line_six": "You can certainly win this conflict. Such a victory, though, will bring a lifetime of defending your prize against thieves and challengers."
    },
    {
      "id": 47,
      "name": "Shih / Recruiting Allies",
      "description": "Deep Water beneath the Earth's surface: Untapped resources are available. The Superior Person nourishes and instructs the people, building a loyal, disciplined following. Good fortune. No mistakes if you follow a course led by experience.  SITUATION ANALYSIS: You must gain support from others. Find a way to make others want to see your objectives met as badly as you want it. How can they profit from the attainment of this goal? Can you command confidence that you are just the person that can bring this plan to fruition? ",
      "line_one": "Knowing neither purpose nor direction, the soldiers march blindly onward.",
      "line_two": "The general marches with his soldiers, sharing their fate, good or bad, facing the consequences of his own decisions. For this he is loved and trusted by all.",
      "line_three": "A wagonload of corpses this way comes.",
      "line_four": "It is never a mistake to retreat to a stronger position.",
      "line_five": "The seasoned veteran is elevated to command, and none too soon. For the game is in the field, and it would be wise to catch it.",
      "line_six": "The victor divides the spoils among the loyal, leaving the jackals with neither reward nor obligation."
    },
    {
      "id": 48,
      "name": "Pi / Bonding",
      "description": "Deep Waters on the face of the Earth: Surface waters flow together. The Superior Person recognizes the situation calls for joining together. Thus he cultivates friendly relations with all.  Good fortune is possible. Cast the coins again to discover if you have the qualities needed to lead such a group. Then there will be no error. Those uncertain will gradually join. Those who join too late will meet with misfortune.  SITUATION ANALYSIS: This is a time of connection with another or others -- not just an alliance, but a melding of parts into a new whole. Such a connection may be too close, too intense for some. Consult the oracle again to see if you have the qualities needed to strengthen and withstand such an intense synthesis. ",
      "line_one": "Confidently and sincerely seeking union. His devotion to you and to truth makes this alliance correct.  Unexpected good fortune.",
      "line_two": "Devotion comes from deep inside you. Good fortune if you keep to your course.",
      "line_three": "You are seeking union with unworthy people.",
      "line_four": "You express your devotion humbly and openly. Good fortune if you keep to this course.",
      "line_five": "The hunter surrounds the game on only three sides, allowing an avenue of escape. In seeking allegiance with others, leave room for them to say 'no'; this way, those choosing to join you will be sincere.",
      "line_six": "Without a head, the union cannot hold together. Misfortune."
    },
    {
      "id": 49,
      "name": "Hsiao Ch'u / Gentle Restraint",
      "description": "Winds of change high in the Heavens: Air currents carry the weather. Dense clouds blow in from the West, but still no rain. The Superior Person fine tunes the image he presents to the world.  Small successes.  SITUATION ANALYSIS: No matter what you do, the fruit of your labors never seems to ripen. Your reward remains just out of reach. Men have gone mad from such anticipation. Don't lose your balance lunging for the brass ring. While the Fates continue to restrain you, go them one better and display a self-generated restraint and grace. Look for the humor in the situation. ",
      "line_one": "He turns back to his proper course. No harm done. In fact, good fortune comes of this return.",
      "line_two": "He lets himself be drawn back. Good fortune.",
      "line_three": "The spokes burst out of a wagon wheel, stopping the couple's journey. The man and wife waste time and energy blaming each other, causing major damage to their love instead of fixing the minor damage to the wagon.",
      "line_four": "By gaining confidence, the man keeps control of the conflict, avoiding the blood that could be spilled by fear. No mistakes.",
      "line_five": "His sincerity is the cord that binds the hearts of others to his. He holds wealth who holds the hearts of others. ",
      "line_six": "The needed rain finally pours down, bringing a well-earned time of rest. It is Nature's time to enrich the crops, so leave it to her. To work the fields in the rain and mud would only undo all good effort. Do not seek more; the gibbous moon seeks to be full, but once full can do nothing but wane."
    },
    {
      "id": 50,
      "name": "Lü / Worrying the Tiger",
      "description": "Heaven shines down on the Marsh which reflects it back imperfectly: Though the Superior Man carefully discriminates between high and low, and acts in accord with the flow of the Tao, there are still situations where a risk must be taken.  You tread upon the tail of the tiger. Not perceiving you as a threat, the startled tiger does not bite. Success.  SITUATION ANALYSIS: You have reached a perilous point in your journey. This is a real gamble -- not a maneuver, not a calculated risk. The outcome is uncertain. If it goes as you hope, you will gain -- but if it turns against you it will cause serious injury, at least to your plans. The best tack is extreme caution and a healthy respect for the danger involved.  Winds of change high in the Heavens: Air currents carry the weather. Dense clouds blow in from the West, but still no rain. The Superior Person fine tunes the image he presents to the world.  Small successes.  SITUATION ANALYSIS: No matter what you do, the fruit of your labors never seems to ripen. Your reward remains just out of reach. Men have gone mad from such anticipation. Don't lose your balance lunging for the brass ring. While the Fates continue to restrain you, go them one better and display a self-generated restraint and grace. Look for the humor in the situation. ",
      "line_one": "He treads the simple path of least resistance, making swift and blameless progress.",
      "line_two": "A man of modest independence treads a smooth and level path. Good fortune if you stay on course.",
      "line_three": "A one-eyed man may still see, a lame man may still walk, but it takes every resource to circumvent the tiger. When this tiger is stepped on he bites. Only a warrior supremely loyal to his cause would enter a battle he knows he hasn't the resources to survive.",
      "line_four": "He shows humble hesitation and breathless caution, yet still resolutely takes a necessary step on the tail of the tiger. His modest manner saves him from the bite.",
      "line_five": "Though fully aware of the danger that lies on the narrow path ahead, the man is fully commited to move forward. The future is uncertain.",
      "line_six": "At your journey's end, look back and examine the path you chose. If you find no causes for shame, only good works that make you shine, you may take this as an omen of the certainty of great reward."
    },
    {
      "id": 51,
      "name": "Ch'ien / Creative Activity",
      "description": "Heaven above and Heaven below: Heaven in constant motion. With the strength of the dragon, the Superior Person steels himself for ceaseless activity.  Productive Activity. Potent Influence. Sublime Success if you keep to your course.  SITUATION ANALYSIS: The time for action has come. You now have the focus and the stamina necessary for accomplishing great tasks. The path before you is being cleared and reward lies ahead. ",
      "line_one": "The dragon remains beneath the surface. Do not act.",
      "line_two": "The dragon climbs to the surface. Seek advice from an authority you respect.",
      "line_three": "The Superior Person builds by day and remains vigilant through the night. Danger, but he will persevere.",
      "line_four": "The flying dragon hovers over the chasm from which he was born.",
      "line_five": "The dragon rises high for all to see. He has become the mentor he always longed to find.",
      "line_six": "Even a dragon may fly too high."
    },
    {
      "id": 52,
      "name": "K'un / Receptive Force",
      "description": "Earth above and Earth below: The Earth contains and sustains. In this situation, the Superior Person should not take the initiative; he should follow the initiative of another. He should seek receptive allies in the southwest; he should break ties with immovable allies in the northeast.  Responsive devotion. Receptive influence. Sublime Success if you keep to your course.  SITUATION ANALYSIS: This is a time for dealing with reality as it is, not as you would have it be. If you realize that in this situation you are the receptor, not the transmitter of the stimulus, you will find yourself reaching goals that seemed unattainable under your own steam. If you persist in futile efforts to be the Shaper rather than the Shaped, you will completely miss this unique opportunity. ",
      "line_one": "When frost crunches underfoot can winter ice be far behind?",
      "line_two": "Straight, square, and true. By being instead of doing, nothing is left undone.",
      "line_three": "Hide your brilliance. Feeling no threat, they won't resist the completion of your goal. All you lose is credit for the accomplishment.",
      "line_four": "Be a tied-up sack, letting your inner contents remain unseen. There will be no praise, but also no blame.",
      "line_five": "A yellow robe. Supreme good fortune.",
      "line_six": "The battling dragons are too evenly matched. Each spills black and yellow blood to the soil below."
    },
    {
      "id": 53,
      "name": "Chun / Difficulty at the Beginning",
      "description": "Thunder from the Deep: The Superior Person carefully weaves order out of confusion.  Supreme Success if you keep to your course. Carefully consider the first move. Seek help.  SITUATION ANALYSIS: New ventures always pack along their inherent chaos. Though this is an annoyance at best, and can even imperil or downright doom an endeavor, it is also the friction needed to polish your project to jewel brilliance. Learn from these early obstacles. ",
      "line_one": "You have run up against an obstacle at the very head of the trail. Keep to your course. Seek mutual aid.",
      "line_two": "Her horses rear in fright; but the highwayman means no harm. He seeks only the hand of the maiden. She must refuse him, for she fears a very long journey lies ahead before she can marry.",
      "line_three": "A hunter who pursues his prey without a guide will lose his way in the deeps of the forest. The Superior Person knows his limitations and gives up the chase. To advance brings regret.",
      "line_four": "Her horses break away. Turning back, she must learn to trust, and accept the escort of her spurned highwayman. What seemed at first misfortune will lead to marriage.",
      "line_five": "He could rescue them, if only they would trust. For now, he must provide protection and small comfort from the shadows.",
      "line_six": "The horses break free. If the need for aid goes unrecognized, tears and blood will flow."
    },
    {
      "id": 54,
      "name": "Mêng / Inexperience",
      "description": "A fresh Spring at the foot of the Mountain: The Superior Person refines his character by being thorough in every activity. The Sage does not recruit students; the students seek him. He asks nothing but a sincere desire to learn. If the student doubts or challenges his authority, the Sage regretfully cuts his losses.  SITUATION ANALYSIS: This is a time of interchange between a mentor and pupil. Whether you are the teacher or the student, it is a time of companionship along a mutual path. This hexagram also emphasizes the eternal, cyclical nature of the mentor/student relationship -- a mentor is merely a more seasoned pupil, further along on the journey. A pupil holds within himself the seed of a future Master. ",
      "line_one": "A little discipline will make the fool sit up and take notice. Afterwards, the matter should be dropped, or some will question which is the master and which the fool.",
      "line_two": "The man is gentle with the misguided and understands the hearts of women.  Such a one can be trusted with the kingdom.",
      "line_three": "No one respects a lovestruck woman who throws herself at the object of her desire. Do not idolize.",
      "line_four": "You are so terrified of being wrong, you leave no room for learning what is right.",
      "line_five": "Like a wide-eyed child, you wholly and naively trust the goodness of others. Such honor brings out their best.",
      "line_six": " The best way to prove a fool wrong is to let him have his way. To severely restrict his folly will invite him to always believe that his way would have been right."
    },
    {
      "id": 55,
      "name": "Hsü / Calculated Waiting",
      "description": " Deep Waters in the Heavens: Thunderclouds approaching from the West, but no rain yet. The Superior Person nourishes himself and remains of good cheer to condition himself for the moment of truth.  Great Success if you sincerely keep to your course. You may cross to the far shore.  SITUATION ANALYSIS: You must now endure this Dangling -- either a carrot before your nose, or a sword above your head. This strange mix of apprehension and anticipation is a Purgatory. There is nothing more you can do to affect the outcome. You must now submit to the Fates. ",
      "line_one": "No trouble in sight, but vague anxieties about what lies beyond the horizon. Whether real or not, the threat has already won your peace of mind.",
      "line_two": "Taking your post in the sand, ceaselessly watching the far shore for enemy movements, you must endure the taunts and contempt of your comrades. Good fortune in the end.",
      "line_three": "Anxiety prods you to premature action. Wading into the river, you become mired in the bed of mud. Not only does the enemy realize you detect them, but they see your vulnerability as an opportunity to strike.",
      "line_four": "The enemy is upon you. You wait in blood, preparing yourself for their blows; but your own ability can see you through, if you stand your ground and maintain balance.",
      "line_five": "You smile and join in the banquet, relaxing and gaining perspective, yet vigilant and prepared for the next onslaught. Such genuine grace under pressure ensures victory and good fortune.",
      "line_six": "The showdown comes, with the opponents too evenly matched. Just as all hopes of survival are dashed, three strangers appear. They will tip the scales in favor of the contender who recognizes them for what they are."
    },
    {
      "id": 56,
      "name": "Sung / Conflict",
      "description": "The high Heavens over a yawning Deep chasm: An expansive void where nothing can dwell. Even though he sincerely knows he is right, the Superior Person anticipates opposition and carefully prepares for any incident.  Good fortune if your conflict results in compromise. Misfortune if your conflict escalates to confrontation. Seek advice. Postpone your crossing to the far shore.  SITUATION ANALYSIS: Conflict is a necessary part of life. Tension upon the strings of a violin can make majestic music. The critical mass of two hydrogen atoms trying to occupy the same space fuel the sun that nourishes our solar system. Most conflicts you face in life are the result of your Path converging with another's. Your Path is not his, and one Path is not necessarily more right than the other. Can you work together to remove the blockage? ",
      "line_one": "No quarrel will blossom, unless you let your pride fertilize this budding conflict. Let the one who insults you expose himself for what he is. Don't fight this battle until you've already won it.",
      "line_two": "Knowing his comrades would be annihilated against their much stronger foe, he orders a full retreat, retires into seclusion, and is condemned by the very neighbors he saved from ruin.",
      "line_three": "He stands on his integrity, no matter what ill winds may blast him. Stand or fall, in the end he will remain exactly who he is.",
      "line_four": "Realizing the very root of conflict lies within his own heart, he lays down his arms and resolves to accept the things he cannot change.",
      "line_five": "Bring the conflict before a just authority. If you are truly in the right, justice will bring good fortune.",
      "line_six": "You can certainly win this conflict. Such a victory, though, will bring a lifetime of defending your prize against thieves and challengers."
    },
    {
      "id": 57,
      "name": "Shih / Recruiting Allies",
      "description": "Deep Water beneath the Earth's surface: Untapped resources are available. The Superior Person nourishes and instructs the people, building a loyal, disciplined following. Good fortune. No mistakes if you follow a course led by experience.  SITUATION ANALYSIS: You must gain support from others. Find a way to make others want to see your objectives met as badly as you want it. How can they profit from the attainment of this goal? Can you command confidence that you are just the person that can bring this plan to fruition? ",
      "line_one": "Knowing neither purpose nor direction, the soldiers march blindly onward.",
      "line_two": "The general marches with his soldiers, sharing their fate, good or bad, facing the consequences of his own decisions. For this he is loved and trusted by all.",
      "line_three": "A wagonload of corpses this way comes.",
      "line_four": "It is never a mistake to retreat to a stronger position.",
      "line_five": "The seasoned veteran is elevated to command, and none too soon. For the game is in the field, and it would be wise to catch it.",
      "line_six": "The victor divides the spoils among the loyal, leaving the jackals with neither reward nor obligation."
    },
    {
      "id": 58,
      "name": "Pi / Bonding",
      "description": "Deep Waters on the face of the Earth: Surface waters flow together. The Superior Person recognizes the situation calls for joining together. Thus he cultivates friendly relations with all.  Good fortune is possible. Cast the coins again to discover if you have the qualities needed to lead such a group. Then there will be no error. Those uncertain will gradually join. Those who join too late will meet with misfortune.  SITUATION ANALYSIS: This is a time of connection with another or others -- not just an alliance, but a melding of parts into a new whole. Such a connection may be too close, too intense for some. Consult the oracle again to see if you have the qualities needed to strengthen and withstand such an intense synthesis. ",
      "line_one": "Confidently and sincerely seeking union. His devotion to you and to truth makes this alliance correct.  Unexpected good fortune.",
      "line_two": "Devotion comes from deep inside you. Good fortune if you keep to your course.",
      "line_three": "You are seeking union with unworthy people.",
      "line_four": "You express your devotion humbly and openly. Good fortune if you keep to this course.",
      "line_five": "The hunter surrounds the game on only three sides, allowing an avenue of escape. In seeking allegiance with others, leave room for them to say 'no'; this way, those choosing to join you will be sincere.",
      "line_six": "Without a head, the union cannot hold together. Misfortune."
    },
    {
      "id": 59,
      "name": "Hsiao Ch'u / Gentle Restraint",
      "description": "Winds of change high in the Heavens: Air currents carry the weather. Dense clouds blow in from the West, but still no rain. The Superior Person fine tunes the image he presents to the world.  Small successes.  SITUATION ANALYSIS: No matter what you do, the fruit of your labors never seems to ripen. Your reward remains just out of reach. Men have gone mad from such anticipation. Don't lose your balance lunging for the brass ring. While the Fates continue to restrain you, go them one better and display a self-generated restraint and grace. Look for the humor in the situation. ",
      "line_one": "He turns back to his proper course. No harm done. In fact, good fortune comes of this return.",
      "line_two": "He lets himself be drawn back. Good fortune.",
      "line_three": "The spokes burst out of a wagon wheel, stopping the couple's journey. The man and wife waste time and energy blaming each other, causing major damage to their love instead of fixing the minor damage to the wagon.",
      "line_four": "By gaining confidence, the man keeps control of the conflict, avoiding the blood that could be spilled by fear. No mistakes.",
      "line_five": "His sincerity is the cord that binds the hearts of others to his. He holds wealth who holds the hearts of others. ",
      "line_six": "The needed rain finally pours down, bringing a well-earned time of rest. It is Nature's time to enrich the crops, so leave it to her. To work the fields in the rain and mud would only undo all good effort. Do not seek more; the gibbous moon seeks to be full, but once full can do nothing but wane."
    },
    {
      "id": 60,
      "name": "Lü / Worrying the Tiger",
      "description": "Heaven shines down on the Marsh which reflects it back imperfectly: Though the Superior Man carefully discriminates between high and low, and acts in accord with the flow of the Tao, there are still situations where a risk must be taken.  You tread upon the tail of the tiger. Not perceiving you as a threat, the startled tiger does not bite. Success.  SITUATION ANALYSIS: You have reached a perilous point in your journey. This is a real gamble -- not a maneuver, not a calculated risk. The outcome is uncertain. If it goes as you hope, you will gain -- but if it turns against you it will cause serious injury, at least to your plans. The best tack is extreme caution and a healthy respect for the danger involved.  Winds of change high in the Heavens: Air currents carry the weather. Dense clouds blow in from the West, but still no rain. The Superior Person fine tunes the image he presents to the world.  Small successes.  SITUATION ANALYSIS: No matter what you do, the fruit of your labors never seems to ripen. Your reward remains just out of reach. Men have gone mad from such anticipation. Don't lose your balance lunging for the brass ring. While the Fates continue to restrain you, go them one better and display a self-generated restraint and grace. Look for the humor in the situation. ",
      "line_one": "He treads the simple path of least resistance, making swift and blameless progress.",
      "line_two": "A man of modest independence treads a smooth and level path. Good fortune if you stay on course.",
      "line_three": "A one-eyed man may still see, a lame man may still walk, but it takes every resource to circumvent the tiger. When this tiger is stepped on he bites. Only a warrior supremely loyal to his cause would enter a battle he knows he hasn't the resources to survive.",
      "line_four": "He shows humble hesitation and breathless caution, yet still resolutely takes a necessary step on the tail of the tiger. His modest manner saves him from the bite.",
      "line_five": "Though fully aware of the danger that lies on the narrow path ahead, the man is fully commited to move forward. The future is uncertain.",
      "line_six": "At your journey's end, look back and examine the path you chose. If you find no causes for shame, only good works that make you shine, you may take this as an omen of the certainty of great reward."
    },
    {
      "id": 61,
      "name": "Ch'ien / Creative Activity",
      "description": "Heaven above and Heaven below: Heaven in constant motion. With the strength of the dragon, the Superior Person steels himself for ceaseless activity.  Productive Activity. Potent Influence. Sublime Success if you keep to your course.  SITUATION ANALYSIS: The time for action has come. You now have the focus and the stamina necessary for accomplishing great tasks. The path before you is being cleared and reward lies ahead. ",
      "line_one": "The dragon remains beneath the surface. Do not act.",
      "line_two": "The dragon climbs to the surface. Seek advice from an authority you respect.",
      "line_three": "The Superior Person builds by day and remains vigilant through the night. Danger, but he will persevere.",
      "line_four": "The flying dragon hovers over the chasm from which he was born.",
      "line_five": "The dragon rises high for all to see. He has become the mentor he always longed to find.",
      "line_six": "Even a dragon may fly too high."
    },
    {
      "id": 62,
      "name": "K'un / Receptive Force",
      "description": "Earth above and Earth below: The Earth contains and sustains. In this situation, the Superior Person should not take the initiative; he should follow the initiative of another. He should seek receptive allies in the southwest; he should break ties with immovable allies in the northeast.  Responsive devotion. Receptive influence. Sublime Success if you keep to your course.  SITUATION ANALYSIS: This is a time for dealing with reality as it is, not as you would have it be. If you realize that in this situation you are the receptor, not the transmitter of the stimulus, you will find yourself reaching goals that seemed unattainable under your own steam. If you persist in futile efforts to be the Shaper rather than the Shaped, you will completely miss this unique opportunity. ",
      "line_one": "When frost crunches underfoot can winter ice be far behind?",
      "line_two": "Straight, square, and true. By being instead of doing, nothing is left undone.",
      "line_three": "Hide your brilliance. Feeling no threat, they won't resist the completion of your goal. All you lose is credit for the accomplishment.",
      "line_four": "Be a tied-up sack, letting your inner contents remain unseen. There will be no praise, but also no blame.",
      "line_five": "A yellow robe. Supreme good fortune.",
      "line_six": "The battling dragons are too evenly matched. Each spills black and yellow blood to the soil below."
    },
    {
      "id": 63,
      "name": "Chun / Difficulty at the Beginning",
      "description": "Thunder from the Deep: The Superior Person carefully weaves order out of confusion.  Supreme Success if you keep to your course. Carefully consider the first move. Seek help.  SITUATION ANALYSIS: New ventures always pack along their inherent chaos. Though this is an annoyance at best, and can even imperil or downright doom an endeavor, it is also the friction needed to polish your project to jewel brilliance. Learn from these early obstacles. ",
      "line_one": "You have run up against an obstacle at the very head of the trail. Keep to your course. Seek mutual aid.",
      "line_two": "Her horses rear in fright; but the highwayman means no harm. He seeks only the hand of the maiden. She must refuse him, for she fears a very long journey lies ahead before she can marry.",
      "line_three": "A hunter who pursues his prey without a guide will lose his way in the deeps of the forest. The Superior Person knows his limitations and gives up the chase. To advance brings regret.",
      "line_four": "Her horses break away. Turning back, she must learn to trust, and accept the escort of her spurned highwayman. What seemed at first misfortune will lead to marriage.",
      "line_five": "He could rescue them, if only they would trust. For now, he must provide protection and small comfort from the shadows.",
      "line_six": "The horses break free. If the need for aid goes unrecognized, tears and blood will flow."
    },
    {
      "id": 64,
      "name": "Mêng / Inexperience",
      "description": "A fresh Spring at the foot of the Mountain: The Superior Person refines his character by being thorough in every activity. The Sage does not recruit students; the students seek him. He asks nothing but a sincere desire to learn. If the student doubts or challenges his authority, the Sage regretfully cuts his losses.  SITUATION ANALYSIS: This is a time of interchange between a mentor and pupil. Whether you are the teacher or the student, it is a time of companionship along a mutual path. This hexagram also emphasizes the eternal, cyclical nature of the mentor/student relationship -- a mentor is merely a more seasoned pupil, further along on the journey. A pupil holds within himself the seed of a future Master. ",
      "line_one": "A little discipline will make the fool sit up and take notice. Afterwards, the matter should be dropped, or some will question which is the master and which the fool.",
      "line_two": "The man is gentle with the misguided and understands the hearts of women.  Such a one can be trusted with the kingdom.",
      "line_three": "No one respects a lovestruck woman who throws herself at the object of her desire. Do not idolize.",
      "line_four": "You are so terrified of being wrong, you leave no room for learning what is right.",
      "line_five": "Like a wide-eyed child, you wholly and naively trust the goodness of others. Such honor brings out their best.",
      "line_six": " The best way to prove a fool wrong is to let him have his way. To severely restrict his folly will invite him to always believe that his way would have been right."
    }
  ]
}
